# SetLayoutDialogSize

## Description
Sets a Layout Manager dialog's size, in pixels.

```pascal
PROCEDURE SetLayoutDialogSize(
				dialogID : LONGINT;
				width    : INTEGER;
				height   : INTEGER);
```

```python

def vs.SetLayoutDialogSize(dialogID, width, height):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|width|INTEGER||
|height|INTEGER||

## Version
Availability: from VectorWorks12.0
## Category
* Dialogs - Modern